:PROPERTIES:
:ID:       b6d2c374-bdd0-4034-a27f-c44af23c5d9e
:END:
#+TITLE: Apple
#+DESCRIPTION: Apple
#+TAGS:

**** Luckily

The example API request apparently has all the categories. And there are a
shitton of sticker categories for all you happy ass people to share to each
other -- meanwhile, most of those features are absolutely meaningless to me:
I've never used almost any new, non-technical features since about 2015. The
social features? almost zero.

#+begin_src jq :in-file ./data/appstoreconnect.appCategories.json :results table :cmd-line "-r"
.data | map(select(.relationships.parent.data == null))
  | sort_by(.id)
  | map([.id, (.attributes.platforms | join(","))])
  | @text
#+end_src

#+RESULTS:
| BOOKS                    | IOS,MAC_OS,TV_OS |
| BUSINESS                 | IOS,MAC_OS,TV_OS |
| DEVELOPER_TOOLS          | IOS,MAC_OS,TV_OS |
| EDUCATION                | IOS,MAC_OS,TV_OS |
| ENTERTAINMENT            | IOS,MAC_OS,TV_OS |
| FINANCE                  | IOS,MAC_OS,TV_OS |
| FOOD_AND_DRINK           | IOS,MAC_OS,TV_OS |
| GAMES                    | IOS,MAC_OS,TV_OS |
| GRAPHICS_AND_DESIGN      | IOS,MAC_OS,TV_OS |
| HEALTH_AND_FITNESS       | IOS,MAC_OS,TV_OS |
| LIFESTYLE                | IOS,MAC_OS,TV_OS |
| MAGAZINES_AND_NEWSPAPERS | IOS,MAC_OS,TV_OS |
| MEDICAL                  | IOS,MAC_OS,TV_OS |
| MUSIC                    | IOS,MAC_OS,TV_OS |
| NAVIGATION               | IOS,MAC_OS,TV_OS |
| NEWS                     | IOS,MAC_OS,TV_OS |
| PHOTO_AND_VIDEO          | IOS,MAC_OS,TV_OS |
| PRODUCTIVITY             | IOS,MAC_OS,TV_OS |
| REFERENCE                | IOS,MAC_OS,TV_OS |
| SHOPPING                 | IOS,MAC_OS,TV_OS |
| SOCIAL_NETWORKING        | IOS,MAC_OS,TV_OS |
| SPORTS                   | IOS,MAC_OS,TV_OS |
| STICKERS                 | IOS              |
| TRAVEL                   | IOS,MAC_OS,TV_OS |
| UTILITIES                | IOS,MAC_OS,TV_OS |
| WEATHER                  | IOS,MAC_OS,TV_OS |



